config/cf/Documents/РС_Занятость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РС_Занятость</Name>
			<BasedOn>
				<xr:Item>Document.Задание</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РС_Работы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяТрудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаВремениКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматированноеОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распределять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/cf/AccumulationRegisters/РС_Работы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>РС_Работы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФактическоеВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачисленоСотруднику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Занятость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РС_Занятость</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/cf/InformationRegisters/Трудозатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Трудозатраты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Comment>// то, что пользователь указал вручную (в секундах) рабочее время</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект трудозатрат</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТрудозатратыОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Для кого выполнены работы</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИнициаторЗадания</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Кем выполнены работы</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУникальности</Name>
					<Comment>Уникальный идентификатор уникальности</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/Documents/РС_Занятость/Ext/ObjectModule.bsl
Процедура ЗаполнитьНовыйДокумент() Экспорт
	СпособРасчетаВремениКлиента 	= 1;
	ДатаНачала 						= ПолучитьМаксимальнуюДату();
	ДатаОкончания 					= ТекущаяДата() + 300;
	Исполнитель						= Пользователи.ТекущийПользователь();
	ВидРаботы						= Справочники.ВидыРабот.ВыполнениеЗаданий;
	ФактВремя 						= ДатаОкончания - ДатаНачала;
	ФактическаяТрудоемкость 		= ФактВремя/3600;	
	ВремяКлиента 					= ФактическаяТрудоемкость; 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задание") тогда
		Задание = ДанныеЗаполнения;
	ИначеЕсли  ТипЗнч(ДанныеЗаполнения) = Тип("Структура") тогда
		Если ДанныеЗаполнения.Свойство("ДокументЗадания") тогда
			Задание = ДанныеЗаполнения.ДокументЗадания;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьНовыйДокумент();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 ДвиженияРС_Работы();
	 ДвиженияТрудозатраты();
	 Движения.Записать();
КонецПроцедуры

Процедура ДвиженияРС_Работы()
	Движения.РС_Работы.Очистить();
	Движения.РС_Работы.Записывать 	= Истина;
	НоваяЗапись 					= Движения.РС_Работы.Добавить();
	НоваяЗапись.Период 				= ДатаНачала;
	НоваяЗапись.ВидДвижения 		= ВидДвиженияНакопления.Приход;
	НоваяЗапись.ВремяКлиента		= ВремяКлиента;
	НоваяЗапись.Занятость			= Ссылка;
	НоваяЗапись.ФактическоеВремя	= ФактическаяТрудоемкость;	
КонецПроцедуры

Процедура ДвиженияТрудозатраты()
	ЗаписиРегистра = РегистрыСведений.Трудозатраты.СоздатьНаборЗаписей();
	ЗаписиРегистра.Отбор.Объект.Установить(Задание);
	ЗаписиРегистра.Отбор.Инициатор.Установить(Задание.Инициатор);
	ЗаписиРегистра.Отбор.Исполнитель.Установить(Исполнитель);
	ЗаписиРегистра.Отбор.КлючУникальности.Установить(Ссылка.УникальныйИдентификатор());
	ЗаписиРегистра.Прочитать();
	ЗаписиРегистра.Очистить();
	НоваяЗапись = ЗаписиРегистра.Добавить();
	НоваяЗапись.Активность = Истина;
	ЗаполнитьЗначенияСвойств(НоваяЗапись,Ссылка);
	НоваяЗапись.Объект = Задание;
	НоваяЗапись.КлючУникальности = Ссылка.УникальныйИдентификатор();
	НоваяЗапись.Инициатор = Задание.Инициатор;
	НоваяЗапись.Длительность = ФактическаяТрудоемкость*3600;
	//НоваяЗапись.Результат = Результат;                                        //++
	ЗаписиРегистра.Записать();
КонецПроцедуры

Функция ПолучитьМаксимальнуюДату() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(Трудозатраты.ДатаОкончания) КАК ДатаОкончания
	               |ИЗ
	               |	РегистрСведений.Трудозатраты КАК Трудозатраты
	               |ГДЕ
	               |	Трудозатраты.Исполнитель = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель", Пользователи.ТекущийПользователь());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат ?(Выборка.ДатаОкончания = Дата('00010101'), ТекущаяДата(),Выборка.ДатаОкончания);
	Иначе
		Возврат ТекущаяДата();	
	КонецЕсли;
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	ЗаписиРегистра = РегистрыСведений.Трудозатраты.СоздатьНаборЗаписей();
	ЗаписиРегистра.Отбор.Объект.Установить(Задание);
	ЗаписиРегистра.Отбор.Инициатор.Установить(Задание.Инициатор);
	ЗаписиРегистра.Отбор.Исполнитель.Установить(Исполнитель);
	ЗаписиРегистра.Отбор.КлючУникальности.Установить(Ссылка.УникальныйИдентификатор());
	ЗаписиРегистра.Прочитать();
	ЗаписиРегистра.Очистить();
	ЗаписиРегистра.Записать();
КонецПроцедуры
